{
  "translation": {
    "navbar": {
      "experience": "Experience",
      "projects": "Projects",
      "skills": "Skills",
      "about": "About",
      "contact": "Contact"
    },
    "badge": "Open to work!",
    "description": {
      "experience": "+4 years of working experience.",
      "role": "Software Engineer and FullStack Developer.",
      "location": "From San Carlos, Costa Rica."
    },
    "documentation": {
      "download": "Download",
      "talk": "Let's Talk"
    },
    "experience": {
      "title": "Experience",
      "role1": {
        "title": "Full Stack Developer",
        "date": "May 2019 - present",
        "company": "Freelance",
        "description": "Contributed to the development of responsive web applications for various clients across diverse industries using cutting-edge technologies such as React, Next.js, Node.js, GraphQL, and Express.js.",
        "achievements": {
          "achievement1": "Contributed to the development and enhancement of the admissions processing system for a group of universities, ensuring streamlined and efficient processing of applications.",
          "achievement2": "Implemented PayPal payment processing for university admission tax payments, enhancing the efficiency and security of the payment system.",
          "achievement3": "Assisted in building a data processing system, enhancing the analysis and interpretation of data generated by data scientists.",
          "achievement4": "Implemented code-testing methodologies to detect and rectify errors and technical challenges both pre and post-implementation.",
          "achievement5": "Integrated AWS services to deploy, scale, and monitor an internal data processing application for a scientific startup."
        }
      },
      "role2": {
        "title": "Junior Application Developer",
        "date": "July 2018 - December 2018",
        "company": "Fundación Omar Dengo",
        "description": "Contribute to the development of an educational web application using technologies such as PHP and Slim framework, Ajax, JavaScript, jQuery, HTML5, CSS, Bootstrap, and SQL Server",
        "achievements": {
          "achievement1": "Worked within the Scrum development methodology, achieving a 95% completion rate for sprint tasks.",
          "achievement2": "Collaborated closely with design teams to meet development requirements and enhance the overall user experience."
        }
      },
      "buttonText": {
        "main": "Read",
        "more": "More",
        "less": "Less"
      }
    },
    "projects": {
      "title": "Projects",
      "project1": {
        "title": "CPI Website",
        "description": "Official site for CPI Spanish Immersion School located in Costa Rica. This website provides a comprehensive overview of their programs, locations, and the unique experiences they offer."
      },
      "project2": {
        "title": "Touring Regal",
        "description": "Touring Regal is dedicated to transforming the transportation experience in Costa Rica, aligning with a distinctive mission and vision that encapsulates their commitment to excellence, safety, and sustainability."
      },
      "buttonText": "Visit the website"
    },
    "skills": {
      "title": "Skills",
      "subTitle": "Technologies I've been working with recently"
    },
    "about": {
      "title": "About Me",
      "text1": {
        "pt1": "My name is Roberto Chavarria, a Full Stack Developer with over 4 years of hands-on experience in web development",
        "hgt1": "using top JavaScript frameworks, including Next.js, React, Angular, and Node.js."
      },
      "text2": {
        "pt1": "My journey in web development includes impactful achievements, such as collaborating with a startup to",
        "hgt1": "build an application crucial for processing extensive datasets ",
        "pt2": "from their data scientists. Additionally, I have proven track record in managing independent projects and delivering ",
        "hgt2": "responsive, user-centric platforms."
      },
      "text3": "I'm passionate about leveraging technology to solve complex challenges and collaborating on innovative projects, creating cutting-edge web solutions with the latest technologies.",
      "text4": "Interested in learning"
    },
    "contact": {
      "title": "Contact Me",
      "subTitle": "Get in touch!",
      "text": "I'm currently available for work. Fill out the form and I'll get back to you as soon as possible.",
      "form": {
        "input1": {
          "title": "Full Name"
        },
        "input2": {
          "title": "Email"
        },
        "input3": {
          "title": "Message",
          "placeholder": "Type your message"
        },
        "buttonText": "Let's Talk"
      }
    },
    "footer": {
      "text1": "All Rights Reserved",
      "text2": "Inspired by",
      "text3": "design",
      "text4": "Made with"
    }
  }
}
